---
kind: property
id: P:Autodesk.Revit.DB.TextElement.HorizontalAlignment
source: html/13fde654-9ee9-8852-bbc0-708e19bc0fb5.htm
---
# Autodesk.Revit.DB.TextElement.HorizontalAlignment Property

Horizontal alignment of the text content within the text area of the element.

## Syntax (C#)
```csharp
public HorizontalTextAlignment HorizontalAlignment { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration